app/controllers/rooms_controller.rb

	def index
		@rooms = Room.where(:public => true).order("created_at DESC")
		@new_room = Room.new
		@users = User.all
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."public" = 't' ORDER BY created_at DESC
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

	def create
		if @opentok.nil?
			raise "Error! @opentok object was nil"
		else
			@calledUser = User.find(params[:user_id])
			session = @opentok.create_session request.remote_addr
			@calledUser
			# params[:room][:sessionId] = session.session_id unless params[:room].nil?
			@new_room = Room.new()
			@new_room.user_id = params[:user_id]
			@new_room.sessionId = session.session_id

			respond_to do |format|
				if @new_room.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "rooms" ("created_at", "name", "public", "sessionId", "updated_at") VALUES (?, ?, ?, ?, ?)

	def party
		@room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]