app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "description", "due", "name", "priority", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    # Passes the attributes, but user_id also gets passed
    @task = current_user.tasks.build(task_params)
    # @task = Task.new(task_params)

    respond_to do |format|
      if @task.save